[
  {
    "year": "1893",
    "text": "On August 12, 1893, in the presence of Emperor Alexander III, an official ceremony was held for the establishment of a naval base at the western outpost of the Russian Empire, which was named \"Port of Emperor Alexander III\" in 1894.",
    "image": "history1.png"
  },
  {
    "year": "1898",
    "text": "By the summer of 1898, one dry dock, a shipbuilding and mechanical workshop, a forge, and warehouses had been constructed. To provide access for ships to the plant's waterfront and the docks under construction, a canal was excavated with two basins: one for anchorage and the other for repairs.",
    "image": "history2.jpg"
  },
  {
    "year": "1900",
    "text": "In 1900, the construction of two dry docks was completed on the territory of the military port, named in honor of Empresses Maria and Alexandra. In the same year, mechanical, ship repair, and construction workshops began operating.",
    "image": "history3.jpg"
  },
  {
    "year": "1903",
    "text": "In 1903-1905, employees of the Workshops on the territory of the military port assembled submarines purchased by the imperial government in the United States, which were imported to Libau disassembled.",
    "image": "history4.jpg"
  },
  {
    "year": "1904",
    "text": "In the autumn of 1904, Emperor Nicholas II visited Libau. After inspecting the military port, he stated that it was necessary to continue expanding the port and that the work already done was insufficient.",
    "image": "history5.jpg"
  },
  {
    "year": "1905",
    "text": "In 1904-1905, the dry docks were used for preparing the ships of the Pacific Squadron for their voyage. Prior to World War II, the procedure for placing ships in the docks was carried out using the Maltese method.",
    "image": "history6.jpg"
  },
  {
    "text": "In November 1905, the workshops were supplemented with a floating dock with a lifting capacity of 1600 tons.",
    "image": "history7.jpg"
  },
  {
    "text": "After making peace with Japan, the ships arriving from the Far East underwent restoration and repairs in Libau, including the cruisers \"Aurora\" and \"Almaz.\"",
    "image": "history8.jpg"
  },
  {
    "year": "1915",
    "text": "During World War I, in April 1915, orders were given to abandon the port of Libau and surrender Libau. As a result, both dry docks were detonated, and part of the workshop equipment was destroyed.",
    "image": "history9.jpg"
  },
  {
    "year": "1918",
    "text": "From late 1918, the workshops were used for repair work on ships of the English and German fleets that occupied the port.",
    "image": "history10.jpg"
  },
  {
    "year": "1930",
    "text": "Up until 1938, in addition to ship repair, the plant was involved in the construction of boats and launches, pontoons, boilers, cranes, and tanks.",
    "image": "history11.jpg"
  },
  {
    "text": "Construction of railway artillery platforms, passenger carriages for Latvia, and heavy-duty refrigerated wagons was also undertaken.",
    "image": "history12.jpg"
  },
  {
    "text": "In the 1930s, a new type of production was introduced at the plant - aircraft repair and construction. In 1936, the factory produced a series of aircraft for a new squadron.",
    "image": "history13.png"
  },
  {
    "year": "1940",
    "text": "During the Soviet period, the plant served as the largest repair base for the Baltic Fleet. Various military ships, auxiliary vessels, and submarines were repaired and refitted in the docks and at the factory's piers. Up to 5,000 people worked in the workshops and on the repair projects.",
    "image": "history14.jpg"
  },
  {
    "year": "Our days",
    "text": "At present, the united team of the \"LZK\" company proudly continues the work of the plant, preserving centuries-old traditions of professional ship repair and employing innovative technologies to address tasks of any complexity.",
    "image": "history15.jpg"
  }
]
